// let questionArray = ['question1', 'question2', 'question3', 'question4', 'question5', 'question6', 'question7', 'question8', 'question9', 'question10', 'question11', 'question12', 'question13', 'question14', 'question15'];
let questionArray = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15];
const openAccountQuestions = {
  question: {
    question1: 'Счет Вопрос 1?',
    question2: 'Вопрос 2?',
    question3: 'Вопрос 3?',
    question4: 'Вопрос 4?',
    question5: 'Вопрос 5?',
    question6: 'Вопрос 6?',
    question7: 'Вопрос 7?',
    question8: 'Вопрос 8?',
    question9: 'Вопрос 9?',
    question10: 'Вопрос 10?',
    question11: 'Вопрос 11?',
    question12: 'Вопрос 12?',
    question13: 'Вопрос 13?',
    question14: 'Вопрос 14?',
    question15: 'Вопрос 15?'
  },
  answers: {
    question1: {
      a: 'Ответ верный',
      b: 'Ответ не верный',
      c: 'Ответ не верный',
      d: 'Ответ не верный'
    },
    question2: {
      a: 'Ответ не верный',
      b: 'Ответ верный',
      c: 'Ответ не верный',
      d: 'Ответ не верный'
    },
    question3: {
      a: 'Ответ не верный',
      b: 'Ответ не верный',
      c: 'Ответ верный',
      d: 'Ответ не верный'
    },
    question4: {
      a: 'Ответ не верный',
      b: 'Ответ не верный',
      c: 'Ответ не верный',
      d: 'Ответ верный'
    },
    question5: {
      a: 'Ответ верный',
      b: 'Ответ не верный',
      c: 'Ответ не верный',
      d: 'Ответ не верный'
    },
    question6: {
      a: 'Ответ не верный',
      b: 'Ответ верный',
      c: 'Ответ не верный',
      d: 'Ответ не верный'
    },
    question7: {
      a: 'Ответ не верный',
      b: 'Ответ не верный',
      c: 'Ответ верный',
      d: 'Ответ не верный'
    },
    question8: {
      a: 'Ответ не верный',
      b: 'Ответ не верный',
      c: 'Ответ не верный',
      d: 'Ответ верный'
    },
    question9: {
      a: 'Ответ верный',
      b: 'Ответ не верный',
      c: 'Ответ не верный',
      d: 'Ответ не верный'
    },
    question10: {
      a: 'Ответ не верный',
      b: 'Ответ верный',
      c: 'Ответ не верный',
      d: 'Ответ не верный'
    },
    question11: {
      a: 'Ответ не верный',
      b: 'Ответ не верный',
      c: 'Ответ верный',
      d: 'Ответ не верный'
    },
    question12: {
      a: 'Ответ не верный',
      b: 'Ответ не верный',
      c: 'Ответ не верный',
      d: 'Ответ верный'
    },
    question13: {
      a: 'Ответ верный',
      b: 'Ответ не верный',
      c: 'Ответ не верный',
      d: 'Ответ не верный'
    },
    question14: {
      a: 'Ответ не верный',
      b: 'Ответ верный',
      c: 'Ответ не верный',
      d: 'Ответ не верный'
    },
    question15: {
      a: 'Ответ не верный',
      b: 'Ответ не верный',
      c: 'Ответ верный',
      d: 'Ответ не верный'
    }
  }
}
const currencyQuestions = {
  question: {
    question1: 'Какой-то непонятный вопрос 1?',
    question2: 'Какой-то непонятный вопрос 2?',
    question3: 'Какой-то непонятный вопрос 3?',
    question4: 'Какой-то непонятный вопрос 4?',
    question5: 'Какой-то непонятный вопрос 5?',
    question6: 'Какой-то непонятный вопрос 6?',
    question7: 'Какой-то непонятный вопрос 7?',
    question8: 'Какой-то непонятный вопрос 8?',
    question9: 'Какой-то непонятный вопрос 9?',
    question10: 'Какой-то непонятный вопрос 10?',
    question11: 'Какой-то непонятный вопрос 11?',
    question12: 'Какой-то непонятный вопрос 12?',
    question13: 'Какой-то непонятный вопрос 13?',
    question14: 'Какой-то непонятный вопрос 14?',
    question15: 'Какой-то непонятный вопрос 15?'
  },
  answers: {
    question1: {
      a: 'Ответ верный',
      b: 'Ответ не верный',
      c: 'Ответ не верный',
      d: 'Ответ не верный'
    },
    question2: {
      a: 'Ответ не верный',
      b: 'Ответ верный',
      c: 'Ответ не верный',
      d: 'Ответ не верный'
    },
    question3: {
      a: 'Ответ не верный',
      b: 'Ответ не верный',
      c: 'Ответ верный',
      d: 'Ответ не верный'
    },
    question4: {
      a: 'Ответ не верный',
      b: 'Ответ не верный',
      c: 'Ответ не верный',
      d: 'Ответ верный'
    },
    question5: {
      a: 'Ответ верный',
      b: 'Ответ не верный',
      c: 'Ответ не верный',
      d: 'Ответ не верный'
    },
    question6: {
      a: 'Ответ не верный',
      b: 'Ответ верный',
      c: 'Ответ не верный',
      d: 'Ответ не верный'
    },
    question7: {
      a: 'Ответ не верный',
      b: 'Ответ не верный',
      c: 'Ответ верный',
      d: 'Ответ не верный'
    },
    question8: {
      a: 'Ответ не верный',
      b: 'Ответ не верный',
      c: 'Ответ не верный',
      d: 'Ответ верный'
    },
    question9: {
      a: 'Ответ верный',
      b: 'Ответ не верный',
      c: 'Ответ не верный',
      d: 'Ответ не верный'
    },
    question10: {
      a: 'Ответ не верный',
      b: 'Ответ верный',
      c: 'Ответ не верный',
      d: 'Ответ не верный'
    },
    question11: {
      a: 'Ответ не верный',
      b: 'Ответ не верный',
      c: 'Ответ верный',
      d: 'Ответ не верный'
    },
    question12: {
      a: 'Ответ не верный',
      b: 'Ответ не верный',
      c: 'Ответ не верный',
      d: 'Ответ верный'
    },
    question13: {
      a: 'Ответ верный',
      b: 'Ответ не верный',
      c: 'Ответ не верный',
      d: 'Ответ не верный'
    },
    question14: {
      a: 'Ответ не верный',
      b: 'Ответ верный',
      c: 'Ответ не верный',
      d: 'Ответ не верный'
    },
    question15: {
      a: 'Ответ не верный',
      b: 'Ответ не верный',
      c: 'Ответ верный',
      d: 'Ответ не верный'
    }
  }
}
const finansialDepartmentQuestions = {
  question: {
    question1: 'Від якої суми потрібно підтвердження джерел походження коштів?',
    question2: 'Який документ не підходить як джерело, що підтверджує походження коштів?',
    question3: 'За якої умови договір купівлі/продажу нерухомого майна буде прийнято банком?',
    question4: 'Які операції не підлягають контролю з боку банку?',
    question5: 'Які документи необхідні для надання фінансової допомоги у сумі до 400 000,00 грн.?',
    question6: 'Дії банку у разі неможливості клієнтом підтвердити джерела походження коштів?',
    question7: 'Який документ не підходить як джерело, що підтверджує походження коштів?',
    question8: 'Які операції підлягають контролю з боку банку?',
    question9: 'Хто такий ПЕП (PEP)?',
    question10: 'За якою карткою зняття за кордоном безкоштовно?',
    question11: 'Стару валюту якої країни можна здати та внести на рахунок без комісії?',
    question12: 'Яка максимально допустима сума платежу без відкриття рахунку?',
    question13: 'Які документи необхідні для покупки дорогоцінних монет у касі?',
    question14: 'Операції на яку суму можна провести в касі без паспорта?',
    question15: 'Яку суму може надіслати фізична особа за кордон на рік?'
  },
  answers: {
    question1: {
      a: 'Від 150 000,00 грн.',
      b: 'Від 400 000,00 грн.',
      c: 'Від 50 000,00 грн.',
      d: 'Від 15 000,00 грн.'
    },
    question2: {
      a: 'Довідка ОК-7',
      b: 'Декларація ФОП',
      c: 'Договір продажу майнових прав',
      d: 'Митна декларація'
    },
    question3: {
      a: 'Наявність самого договору',
      b: 'Наявність розписки про отримання коштів',
      c: 'За умови нотаріального засвідчення копії договору',
      d: 'Наявність квитанції про здійснення оплати'
    },
    question4: {
      a: 'Операції з готівкою до 5 000,00 грн.',
      b: 'Зняття коштів понад 400 000,00 грн.',
      c: 'Оплата за купівлю автомобіля',
      d: 'Надсилання коштів на благодійність'
    },
    question5: {
      a: 'Довідка про стан рахунку у банку',
      b: 'Договір надання фінансової допомоги',
      c: 'Лист про можливість надати цю допомогу',
      d: 'Паспорт та ІПН'
    },
    question6: {
      a: 'Відмовити в обслуговуванні та повідомити в ДСФМУ',
      b: 'Провести операцію одноразово',
      c: 'Продовжити обслуговування клієнта',
      d: 'Поставити операції клієнта на ручний контроль'
    },
    question7: {
      a: 'Виписка з рахунку у банку',
      b: 'Розписка друга про надання позики',
      c: 'Довідка ОК-5',
      d: 'Договір купівлі/продажу майна'
    },
    question8: {
      a: 'Зняття невеликих сум з рахунку',
      b: 'Оплата кредиту у сумі до 30 000,00 грн.',
      c: 'Регулярне надання фінансової допомоги',
      d: 'Безготівковий переказ коштів між своїми рахунками'
    },
    question9: {
      a: 'Публічна особа сг. ч.1 ст.1 п.37 ЗУ "Про запобiгання..."',
      b: 'Активний представник соціальних мереж, блогер',
      c: 'Директор приватної компанії',
      d: 'Активний соціальний діяч та меценат'
    },
    question10: {
      a: 'SoloМандри',
      b: 'ВсеМожу',
      c: 'ВсеКарта',
      d: 'Black Platinum'
    },
    question11: {
      a: 'Русскій корабль...',
      b: 'США',
      c: 'України',
      d: 'Китаю'
    },
    question12: {
      a: 'До 5 000,00 грн.',
      b: 'До 15 000,00 грн.',
      c: 'До 150 000,00 грн.',
      d: 'До 400 000,00 грн.'
    },
    question13: {
      a: 'Паспорт',
      b: 'Дозвіл на покупку',
      c: 'Водійське посвідчення',
      d: 'Жодних документів не потрібно'
    },
    question14: {
      a: 'До 500,00 грн.',
      b: 'До 5 000,00 грн.',
      c: 'До 15 000,00 грн.',
      d: 'Паспорт не потрібен'
    },
    question15: {
      a: 'До 200 000,00 дол. США',
      b: 'До 100 000,00 дол. США',
      c: 'До 200 000,00 евро',
      d: 'До 100 000,00 евро'
    }
  }
}


const openAccountAnswer = {
  question1: 'Ответ верный',
  question2: 'Ответ верный',
  question3: 'Ответ верный',
  question4: 'Ответ верный',
  question5: 'Ответ верный',
  question6: 'Ответ верный',
  question7: 'Ответ верный',
  question8: 'Ответ верный',
  question9: 'Ответ верный',
  question10: 'Ответ верный',
  question11: 'Ответ верный',
  question12: 'Ответ верный',
  question13: 'Ответ верный',
  question14: 'Ответ верный',
  question15: 'Ответ верный'
}
const currencyAnswer = {
  question1: 'Ответ верный',
  question2: 'Ответ верный',
  question3: 'Ответ верный',
  question4: 'Ответ верный',
  question5: 'Ответ верный',
  question6: 'Ответ верный',
  question7: 'Ответ верный',
  question8: 'Ответ верный',
  question9: 'Ответ верный',
  question10: 'Ответ верный',
  question11: 'Ответ верный',
  question12: 'Ответ верный',
  question13: 'Ответ верный',
  question14: 'Ответ верный',
  question15: 'Ответ верный'
}
const finansialDepartmentAnswer = {
  question1: 'Від 400 000,00 грн.',
  question2: 'Договір продажу майнових прав',
  question3: 'Наявність квитанції про здійснення оплати',
  question4: 'Операції з готівкою до 5 000,00 грн.',
  question5: 'Договір надання фінансової допомоги',
  question6: 'Відмовити в обслуговуванні та повідомити в ДСФМУ',
  question7: 'Розписка друга про надання позики',
  question8: 'Регулярне надання фінансової допомоги',
  question9: 'Публічна особа сг. ч.1 ст.1 п.37 ЗУ "Про запобiгання..."',
  question10: 'ВсеМожу',
  question11: 'України',
  question12: 'До 400 000,00 грн.',
  question13: 'Паспорт',
  question14: 'До 5 000,00 грн.',
  question15: 'До 200 000,00 евро'
}
